import random

GIF_REACTIONS = [
    "Ого, ебать ты мамкин юморист 🤡",
    "Это должно быть смешно или я просто заебался?",
    "Смех — признак нервного срыва. Спасибо.",
    "Мем засчитан. Юмор — нет.",
    "Опять мем. Работать кто-то будет?",
    "Юмор уровня: «пятница, 19:29»",
    "Шо там? Неужели снова хуй отправил?",
    "Хм… я начинаю понимать, почему все умирают от скуки.",
    "Серьезно? Это должно смешить кого-то кроме тебя?",
    "🤡 Местная достопримечательность — твой мем",
    "Заткнись заебал!"
]

PHOTO_REACTIONS = [
    "📸 Ого, ты хомяка поймал",
    "💰 Круто! Вот это бомж красивый",
    "🐺 Баланс есть — а деп будет?",
    "💵 Выглядит как скрин надежды",
    "📊 Скрин есть. А депозит будет?",
    "🐺 С таким балансом можно и депнуть...",
    "Эй, это фото или доказательство будущей нищеты?",
    "Смотрю на это и думаю: «Вся жизнь — хуйня, солнце - ебаный фонарь, остановите землю я сойду...",
    "Магия фотошопа не спасет реальность",
    "Ого, скрин. А где паспорт от банка?",
    "Ха, балансы как психотерапия — лучше не смотреть"
]

TEXT_REACTIONS = [
    "Мы это сейчас обсуждаем или просто пишем?",
    "Интересная мысль. Жаль — бесполезная.",
    "Записал. Удалил.",
    "Это был вопрос или крик души?",
    "Продолжай, мне почти похуй уже.",
    "Логично. Если не думать.",
    "В твоих словах чувствуется запах бедности.",
    "Мне кажется, Вселенная плачет, читая это",
    "О, философия уровня «что-то пошло не так»",
    "Серьезно? Я думал, тут хоть немного смысла будет",
    "💀 Если бы за шутки платили, ты бы умер с голода.",
    "Хто не скаче, той москаль!!!"
]

LUCIFER = (
    "CAACAgIAAxkBAAELVXJpeHeplIUQU_DFFJ-8UZD2rSprZAACoU0AAtW8QEtUa-uvqhhMKDgE",
    "Призыв принят. Администратор ада уже в пути."
)

LUCIFER_KEYS = ["lucifer","люцифер","люцик","luccifer","люсик","сатана"]

# ---------- ГРУППЫ ТРИГГЕРОВ ----------

TRIGGER_GROUPS = [
    (["жопа","срака"],
     "CAACAgIAAxkBAAELWpJpeMN5jbJlJ-l_VqCJtujOmMmsvAACjVoAApReqUmkku5rgA5iGjgE"),

    (["рыба","карась","рыбу","карася","рыбку","рыбка","рыбалка","рыбалку"],
     "CAACAgIAAxkBAAELWpxpeMORp7df3Jht8HSaY3ALWOz8DQAC7FMAAmjOqUmzPhFB7mklRzgE"),

    (["тушкан","тушканчик","тушкана","тушканчика","tushkann","tushkan"],
     "CAACAgIAAxkBAAELWqxpeMRUXxadUxhb9-CeNH6nFlmVngACPHMAAp9tSEkFk1Mi04dOIjgE"),

    (["depozit","dep","деп","депозит","депозитное","депозитный"],
     "CAACAgIAAxkBAAELWrJpeMTalWVKWzQl7w9aUqPcFixifAACOksAAvJl2UlIXsRR10UIGDgE"),

    (["бомба","взрыв","бимба","bomba","взорвать"],
     "CAACAgIAAxkBAAELWslpeMVSiKziV_hcMDqIzq6J4wUwcAACdEoAAp4SSEv23Eh72GXsSjgE"),

    (["конфета","конфетка","сладкое","сладости","фереро"],
     "CAACAgIAAxkBAAELWtNpeMW85NLhK74pGG9gexjlv7i_ZwACZlIAAp7_SEuf5SYwhLtUGjgE"),

    (["крыса","крысюк","крысу"],
     "CAACAgIAAxkBAAELWtppeMaJGCkGQtB5IWNkt8gqdAyBfAACmk0AAjM7QUn2Ka2zTbc__TgE"),

    (["грязь","болото","грязюка","говно","говна","червячки"],
     "CAACAgIAAxkBAAELWuRpeMawz6ScYqEl2tJRo-GuqFv5rwACFEsAAm2VQEsxZ1oayTBMgzgE"),

    (["боль","больно"],
     "CAACAgIAAxkBAAELWvZpeMcn4Kfidu4bujpDyaIqtiHGewACiVYAAr1EqUn3E-f0_Ges6TgE"),

    (["фокус","фокусы"],
     "CAACAgIAAxkBAAELWvppeMdjtn-OZHTa6DRcpS61_OHKIQACL0sAAtPlQUvGYrtRM1z15DgE"),
]

# разворачиваем в словарь слово → gif
TRIGGER_GIFS = {}
for words, gif in TRIGGER_GROUPS:
  for w in words:
    TRIGGER_GIFS[w] = gif
# -------- VOICE REACTIONS --------

VOICE_REACTIONS = {
    ("помогите", "пиздить"): "AwACAgUAAxkBAAMKaXtGXiWeK4LsIgABpmOFVNcNtm8pAALlGAACdF3ZV0eBexSZgk_-OAQ",
    ("условия", "суть"):
      "AwACAgUAAxkDAAMMaXtM2yuNeramk5HHjQsidhW6JSgAAvkYAAJ0XdlXq0DgWzjNz6I4BA",
    ("умник", "умный", "что делать", "ведешь"):
      "AwACAgUAAxkDAAMPaXtN87jpmzcgt_bwUSIYRgHh8RQAAvsYAAJ0XdlXnKrPMs2xtg84BA",
    ("расскажи", "как заработать", "рассказывай"):
      "AwACAgUAAxkDAAMSaXtOiDRjIcjcm8vk8fKsQe0AAQ9fAAL9GAACdF3ZV1kcLSKWWcYKOAQ"
}

def match_voice(text: str):
    text = text.lower()

    for keys, v in VOICE_REACTIONS.items():
        for k in keys:
            if k in text:
                return v

    return None

def match_lucifer(text):
    for k in LUCIFER_KEYS:
        if k in text:
            return LUCIFER
    return None

def gif_reaction():
    return random.choice(GIF_REACTIONS)

def photo_reaction():
    return random.choice(PHOTO_REACTIONS)

def text_reaction():
    return random.choice(TEXT_REACTIONS)